[
  {
    "title" : "Software Development Manager",
    "company" : "Amazon",
    "location" : "Seattle, WA, USA",
    "companyWebsite" : "https://www.amazon.com",
    "logo" : "images/amzn.png",
    "current" : true,
    "startDate" : "May 2022",
    "description" : []
  },
  {
    "title" : "Senior Engineering Manager",
    "company" : "Axon",
    "location" : "Seattle, WA, USA",
    "companyWebsite" : "https:///www.axon.com",
    "logo" : "images/axon.png",
    "startDate" : "January 2021",
    "endDate" : "April 2022",
    "description" : [
      "Managed the teams that developed and launched the device software and backend services for a next generation in-car public safety solution, Axon Fleet 3 with Automated License Plate Recognition (ALPR).",
      "Partnered closely with Axon's imaging and AI/ML teams to integrate models for plate detection, tracking and optical character reognition (OCR).",
      "Worked alongside Product & QA organizations by publishing software updates internally every week."
    ]
  },
  {
    "title" : "Software Engineering Manager",
    "company" : "Axon",
    "location" : "HCMC, Vietnam",
    "companyWebsite" : "https:///www.axon.com",
    "logo" : "images/axon.png",
    "startDate" : "May 2019",
    "endDate" : "December 2020",
    "description" : [
      "Started off leading a single team of three working on a single product and grew it to 13 engineers working across Axon's body worn and in-car camera systems as well as backend services.",
      "Drove and completed an initiative to have all continuous integration as code backed by AWS Compute (EC2) and Storage (S3) to ease onboarding engineers on projects new to them and scale the development of projects.",
      "Adapted team structure and process by re-organizing my team as well as suggesting organizational structure within the division to best align across timezones, company initiatives, support ownership and encourage reuse and quality."
    ]
  },
  {
    "title" : "Staff Software Engineer",
    "company" : "Axon",
    "location" : "Seattle, WA, USA",
    "companyWebsite" : "https:///www.axon.com",
    "logo" : "images/axon.png",
    "startDate" : "Jan 2019",
    "endDate" : "May 2019",
    "description" : [
      "Owned all technical software aspects of a Linux based camera, Axon Body 3, from concept to production. Defined secure, robust and testable architecture for applications running on the camera as well as interfaces between other products including backend services and mobile applications. This involved working with several deparments across the company as well teams in different geographical locations in North America, Asia and Europe.",
      "Worked closely with the company's Information Security department to ensure company's security standards were not only met, but exceeded to design the most secure camera in the industry. This involved designing secure interfaces with all the other products the camera interacted with, getting sign off and then guiding development teams to follow the design.",
      "Chose software technologies to aid in the fast development of the camera's software including Protocol Buffers and Go language. Also setup and managed continious integration with \"pipeline as code\" and \"configuration as code\" in Jenkins to simplify overhead, provide backup and review of continious integration process."
    ]
  },
  {
    "title" : "Senior Software Engineer",
    "company" : "Axon",
    "companyWebsite" : "https:///www.axon.com",
    "location" : "Seattle, WA, USA",
    "logo" : "images/axon.png",
    "startDate" : "Feb 2015",
    "endDate" : "Dec 2018",
    "description" : [
      "Prototyped, designed and implemented custom protocols using standard security technologies for Axon's body worn cameras. These protocols enabled wireless mobile applications on iOS, Android and Windows Phone as well as wired desktop applications on Windows, Linux and MacOS to communicate with Axon's cameras.",
      "Ported wireless software applications using Bluetooth and WiFi from virtualized Linux to µITRON for improved performance for various wireless features of Axon Body cameras. This also improved overall camera performance since virtualized Linux environment could then be removed.",
      "Managed development environment including branching structure, versioning, and continious integration system for builds, automated tests and software releases. Developed python tooling for interaction with our cameras, outputs of our cameras, continious integration server, data indexer and backend log storage. With this tooling, we could create more complex reports than was possible with the data indexer we were using for field monitoring of product health"
    ]
  },
  {
    "title" : "Software Engineer II",
    "company" : "Microsoft",
    "companyWebsite" : "https://www.microsoft.com",
    "location" : "Redmond, WA, USA",
    "logo" : "images/msft.png",
    "startDate" : "Jan 2012",
    "endDate" : "Feb 2015",
    "description" : [
      "Debugged and fixed various Bluetooth Classic and Bluetooth Low Energy issues on Windows Phone 7, 8 and Windows 8.1. Worked through issues with various Bluetooth protocol layers including HCI, L2CAP, GATT, SDP, RFCOMM, OBEX, OPP, AVCTP, AVRCP, AVDTP, A2DP, HFP, and MAP. Worked on compatibility with various popular Bluetooth devices including car systems, wearables and headsets.",
      "Developed an engineering tool to view HCI traces in \"real-time\" and feed them into decoding software such as Frontline Protocol Analysis System. Also developed a framework to imitate Bluetooth device behaviour to reproduce bugs and simulate edge cases."
    ]
  },
  {
    "title" : "Software Engineer",
    "company" : "BlackBerry",
    "companyWebsite" : "https://www.blackberry.com",
    "location" : "Waterloo, ON, Canada",
    "logo" : "images/bbry.png",
    "startDate" : "Jun 2010",
    "endDate" : "Jan 2012",
    "description" : [
      "Essentially created my own role extending from my earlier internship as a Bluetooth tools developer. I developed a system for cataloging Bluetooth devices based on features that were scanned programmatically using a C++ application.",
      "Automated Bluetooth Certification testing through extending an existing framework that already existed at the company to automate user actions on a BlackBerry device. Controlled the execution of certification tests through calling a COM Interface exposed by the Bluetooth Profile Tunning Suite. Previous to this, there was a whole team dedicated to manually running these Certification tests on a regular basis."
    ]
  },
  {
    "title" : "Software Engineer Intern",
    "company" : "BlackBerry",
    "companyWebsite" : "https://www.blackberry.com",
    "location" : "Waterloo, ON, Canada",
    "logo" : "images/bbry.png",
    "startDate" : "Apr 2008",
    "endDate" : "Aug 2009",
    "description" : [
      "Developed applications to assist with engineering processes such as an application that would export test results from a Microsoft Excel Workbook into various QA tools used for reporting."
    ]
  }
]
